<script setup>
import { defineProps } from 'vue';
const props = defineProps(['visible', 'dataId'])

const emit = defineEmits(['close'])



const closeModal = () => {
  emit('close')
}

const fakeData = [
    {
        id: 0,
        title: 'Поиск захоронения',
        description: `Услуга "Поиск захоронения" предназначена для быстрого и удобного нахождения места захоронения усопшего на территории кладбища. Сервис позволяет ввести фамилию, имя, отчество, а также дополнительные данные, такие как годы жизни или участок кладбища, для более точного результата.

        После ввода информации пользователь получает доступ к карточке захоронения, где указаны: точные координаты, номер участка, дата захоронения, а также, при наличии, фотографии надгробия или таблички. Дополнительно отображается маршрут к месту захоронения на карте, что особенно удобно при посещении больших кладбищ или в случае, если вы не были на месте ранее.

        Сервис предназначен как для родственников и друзей усопших, так и для представителей служб ухода за могилами. Он помогает сократить время поиска, исключить ошибки и избежать утомительных обходов участка.

        Интерфейс разработан с учетом потребностей пользователей всех возрастов — понятный, адаптивный и доступный с любого устройства. Данные регулярно обновляются и проверяются на актуальность.

        "Поиск захоронения" — это ваш надежный помощник в заботе о памяти близких.`,
    },
    {
        id: 1,
        title: 'Благоустройство',
        description: `Услуга "Благоустройство захоронения" предназначена для наведения порядка и поддержания достойного внешнего вида на месте захоронения ваших близких. Мы предлагаем комплекс работ, направленных на сохранение чистоты, аккуратности и уважительного отношения к памяти усопших.

        В рамках услуги выполняется уборка территории вокруг могилы, вынос мусора, выравнивание и чистка плит и памятников, удаление сорняков, подрезка кустарников и деревьев, покраска оград, а также посадка цветов или декоративных растений по желанию заказчика. Все работы выполняются аккуратно, с соблюдением всех норм и этических стандартов.

        По завершении благоустройства мы предоставляем фотоотчет, чтобы вы могли убедиться в качестве выполненных работ. Это особенно удобно для тех, кто физически не может часто навещать кладбище, проживает в другом городе или стране.

        Услуга может быть разовой или выполняться на регулярной основе — ежемесячно, ежеквартально или по индивидуальному графику. Мы учитываем все пожелания клиента и готовы предложить персональные решения по оформлению участка.

        "Благоустройство захоронения" — это проявление уважения и любви к ушедшим, даже на расстоянии. Мы помогаем сохранить память в чистоте и порядке.`,
    },
    {
        id: 2,
        title: 'Цифровой мемориал и древо памяти',
        description: `Услуга "Цифровой мемориал и Древо памяти" — это современный способ увековечить память о близком человеке в виртуальном пространстве. Мы создаем персональную страницу памяти, где можно сохранить важные воспоминания, фотографии, видеозаписи, биографию, добрые слова и светлые воспоминания родных и друзей.

        На цифровом мемориале размещается информация об усопшем: годы жизни, фото, истории из жизни, а также сообщения от родных и близких. Это место, где память живёт вне времени и расстояния, доступное в любое время с любого устройства.

        Дополнительно можно построить "Древо памяти" — семейное генеалогическое древо, объединяющее несколько поколений. Это не только дань уважения предкам, но и возможность передать потомкам историю семьи, сохранить родственные связи, узнать больше о своих корнях.

        Услуга особенно ценна для тех, кто хочет сохранить семейную историю и поделиться ею с будущими поколениями. Мы обеспечиваем удобный интерфейс, защиту данных и долгосрочное хранение информации.

        "Цифровой мемориал и Древо памяти" — это больше, чем просто страница, это живая память, соединяющая поколения и сохраняющая тепло людских сердец.`,
    },
    {
        id: 3,
        title: 'Ритуальные услуги',
        description: `Услуга "Ритуальные услуги" охватывает полный спектр поддержки в трудный момент утраты близкого человека. Мы обеспечиваем организацию похорон под ключ с учетом всех религиозных и национальных традиций, заботясь о каждой детали с уважением и профессионализмом.

        В рамках ритуальных услуг мы предоставляем: оформление всех необходимых документов, транспортировку тела, выбор и установку гроба, оформление катафалка, организацию прощальной церемонии, подбор и доставку венков и цветов, музыкальное сопровождение, услуги носильщиков и проведение обряда захоронения.

        Также доступны услуги кремации, организация поминальных обедов, установка памятников, изготовление надгробных плит и последующее благоустройство могилы.

        Наша команда работает круглосуточно, с чуткостью и вниманием к пожеланиям семьи. Мы берем на себя все организационные хлопоты, чтобы вы могли сосредоточиться на прощании с дорогим человеком.

        "Ритуальные услуги" — это поддержка и уважение в самый трудный час.`,
    },
    {
        id: 4,
        title: 'Ритуальные товары',
        description: `Услуга "Ритуальные товары" включает в себя широкий ассортимент изделий и принадлежностей, необходимых для организации похорон и достойного почтения памяти усопшего. Мы предлагаем качественные и проверенные товары, соответствующие религиозным, культурным и личным традициям.

        В наличии:
        — гробы различных видов (эконом, стандарт, премиум);
        — кресты (деревянные, металлические), таблички с гравировкой;
        — венки, корзины и живые цветы;
        — погребальные наборы (покрывала, саваны, нательные крестики, иконы);
        — одежда для усопших;
        — урны для праха;
        — памятники и надгробные плиты.

        Мы помогаем с выбором, оформлением и доставкой всех необходимых товаров в кратчайшие сроки. Возможен индивидуальный заказ: от оформления венка с надписью до изготовления памятника по вашему эскизу.

        "Ритуальные товары" — это достойное сопровождение последнего пути с уважением к каждому человеку.`,
    }
]


</script>

<template>
  <div v-if="visible" class="modal fixed min-w-full min-h-[100vh] flex justify-center items-center z-50">
    <div class="bg-white rounded-lg max-w-[795px] w-full max-h-[90vh] overflow-y-auto m-4">
      <!-- Header -->
      <div class="flex justify-between items-start pt-6 pl-6 pr-6 pb-0 border-b">
        <div class="flex-1">
          <div class="flex items-center gap-2 mb-2">
            <h2 class="text-xl font-bold">{{ fakeData[dataId].title }}</h2>
          </div>
          <div class="text-2xl font-bold">
            
          </div>
        </div>
        <button @click="closeModal" class="text-gray-400 hover:text-gray-600 text-2xl ml-4">
          &times;
        </button>
      </div>
      
      <div class="pt-2 pl-6 pr-6 pb-6">
        <div class="flex gap-[12px]">
            <div class="mb-6">
                <p class="text-base">
                    {{ fakeData[dataId].description }}
                </p>
            </div>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.modal {
  top: 0;
  background: rgba(0, 0, 0, 0.6);
  backdrop-filter: blur(2px);
}
</style> 